-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 03 2024 г., 11:18
-- Версия сервера: 8.0.24
-- Версия PHP: 8.0.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `groups`
--

-- --------------------------------------------------------

--
-- Структура таблицы `students`
--

CREATE TABLE `students` (
  `id_student` int NOT NULL,
  `student_surname` text NOT NULL,
  `student_name` text NOT NULL,
  `student_lastname` text NOT NULL,
  `student_group` text NOT NULL,
  `student_variant` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `students`
--

INSERT INTO `students` (`id_student`, `student_surname`, `student_name`, `student_lastname`, `student_group`, `student_variant`) VALUES
(1, 'Агевнина', 'София', 'Олеговна', 'ИС-22', 7),
(2, 'Безобразов', 'Глеб', 'Андреевич', 'ИС-22', 4),
(3, 'Васьков', 'Александр', 'Дмитриевич', 'ИС-22', 6),
(4, 'Власов', 'Радий', 'Андреевич', 'ИС-22', 9),
(5, 'Дзвониский', 'Дмитрий', 'Максимович', 'ИС-22', 5),
(6, 'Дикарев', 'Вячеслав', 'Юрьевич', 'ИС-22', 6),
(7, 'Иванова', 'Алиса', 'Олеговна', 'ИС-22', 1),
(8, 'Ковалев', 'Александр', 'Алесандрович', 'ИС-22', 4),
(9, 'Кочанов', 'Евгений', 'Александрович', 'ИС-22', 3),
(10, 'Куприянов', 'Илья', 'Николаевич', 'ИС-22', 4),
(11, 'Макеев', 'Антон', 'Юрьевич', 'ИС-22', 9),
(12, 'Мамаджанов', 'Абдулазиз', 'Тахирджанович', 'ИС-22', 6),
(13, 'Павлов', 'Данила', 'Юрьевич', 'ИС-22', 2),
(14, 'Писарев', 'Александр', 'Андреевич', 'ИС-22', 4),
(15, 'Рыбалкин', 'Данил', 'Александрович', 'ИС-22', 9),
(16, 'Синюк', 'Роман', 'Николаевич', 'ИС-22', 6),
(17, 'Столяренко', 'Даниил', 'Александрович', 'ИС-22', 8),
(18, 'Струговец', 'Иван', 'Васильевич', 'ИС-22', 9),
(19, 'Такмаков', 'Виталий', 'Юрьевич', 'ИС-22', 7),
(20, 'Тищенко', 'Ангелина', 'Сергеевна', 'ИС-22', 1),
(21, 'Цара', 'Даниил', 'Артемович', 'ИС-22', 1),
(22, 'Чернышов', 'Владимир', 'Максимович', 'ИС-22', 8),
(23, 'Шелаев', 'Михаил', 'Сергеевич', 'ИС-22', 10),
(24, 'Шидловский', 'Александр', 'Юрьевич', 'ИС-22', 3),
(25, 'Шляков', 'Георгий', 'Андреевич', 'ИС-22', 10),
(26, 'Вяткина', 'Лидия', 'Дмитриевна', 'ИС-22п+', 5),
(27, 'Гасинец', 'Ксения', 'Юрьевна', 'ИС-22п+', 10),
(28, 'Гончаров', 'Денис', 'Александрович', 'ИС-22п+', 7),
(29, 'Кадовба', 'Эдуард', 'Сергеевич', 'ИС-22п+', 7),
(30, 'Кузовлев', 'Евгений', 'Дмитриевич', 'ИС-22п+', 10),
(31, 'Макаров', 'Александр', 'Андреевич', 'ИС-22п+', 5),
(32, 'Муляр', 'Даниил', 'Васильевич', 'ИС-22п+', 2),
(33, 'Поздняков', 'Дарий', 'Валерьевич', 'ИС-22п+', 8),
(34, 'Червяков', 'Данил', 'Александрович', 'ИС-22п+', 8),
(35, 'Шарипов', 'Сергей', 'Александрович', 'ИС-22п+', 2),
(36, 'Ярмонова', 'Елизавета', 'Сергеевна', 'ИС-22п+', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id_student`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `students`
--
ALTER TABLE `students`
  MODIFY `id_student` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
