-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 05 2024 г., 10:22
-- Версия сервера: 8.0.24
-- Версия PHP: 8.0.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `groups`
--

-- --------------------------------------------------------

--
-- Структура таблицы `students`
--

CREATE TABLE `students` (
  `id_student` int NOT NULL,
  `student_surname` text NOT NULL,
  `student_name` text NOT NULL,
  `student_lastname` text NOT NULL,
  `student_group` text NOT NULL,
  `student_variant` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `students`
--

INSERT INTO `students` (`id_student`, `student_surname`, `student_name`, `student_lastname`, `student_group`, `student_variant`) VALUES
(1, 'Агевнина', 'София', 'Олеговна', 'ИС-22', 7),
(2, 'Безобразов', 'Глеб', 'Андреевич', 'ИС-22', 4),
(3, 'Васьков', 'Александр', 'Дмитриевич', 'ИС-22', 6),
(4, 'Власов', 'Радий', 'Андреевич', 'ИС-22', 9),
(5, 'Дзвониский', 'Дмитрий', 'Максимович', 'ИС-22', 5),
(6, 'Дикарев', 'Вячеслав', 'Юрьевич', 'ИС-22', 6),
(7, 'Иванова', 'Алиса', 'Олеговна', 'ИС-22', 1),
(8, 'Ковалев', 'Александр', 'Алесандрович', 'ИС-22', 4),
(9, 'Кочанов', 'Евгений', 'Александрович', 'ИС-22', 3),
(10, 'Куприянов', 'Илья', 'Николаевич', 'ИС-22', 4),
(11, 'Макеев', 'Антон', 'Юрьевич', 'ИС-22', 9),
(12, 'Мамаджанов', 'Абдулазиз', 'Тахирджанович', 'ИС-22', 6),
(13, 'Павлов', 'Данила', 'Юрьевич', 'ИС-22', 2),
(14, 'Писарев', 'Александр', 'Андреевич', 'ИС-22', 4),
(15, 'Рыбалкин', 'Данил', 'Александрович', 'ИС-22', 9),
(16, 'Синюк', 'Роман', 'Николаевич', 'ИС-22', 6),
(17, 'Столяренко', 'Даниил', 'Александрович', 'ИС-22', 8),
(18, 'Струговец', 'Иван', 'Васильевич', 'ИС-22', 9),
(19, 'Такмаков', 'Виталий', 'Юрьевич', 'ИС-22', 7),
(20, 'Тищенко', 'Ангелина', 'Сергеевна', 'ИС-22', 1),
(21, 'Цара', 'Даниил', 'Артемович', 'ИС-22', 1),
(22, 'Чернышов', 'Владимир', 'Максимович', 'ИС-22', 8),
(23, 'Шелаев', 'Михаил', 'Сергеевич', 'ИС-22', 10),
(24, 'Шидловский', 'Александр', 'Юрьевич', 'ИС-22', 3),
(25, 'Шляков', 'Георгий', 'Андреевич', 'ИС-22', 10),
(26, 'Вяткина', 'Лидия', 'Дмитриевна', 'ИС-22п+', 5),
(27, 'Гасинец', 'Ксения', 'Юрьевна', 'ИС-22п+', 10),
(28, 'Гончаров', 'Денис', 'Александрович', 'ИС-22п+', 7),
(29, 'Кадовба', 'Эдуард', 'Сергеевич', 'ИС-22п+', 7),
(30, 'Кузовлев', 'Евгений', 'Дмитриевич', 'ИС-22п+', 10),
(31, 'Макаров', 'Александр', 'Андреевич', 'ИС-22п+', 5),
(32, 'Муляр', 'Даниил', 'Васильевич', 'ИС-22п+', 2),
(33, 'Поздняков', 'Дарий', 'Валерьевич', 'ИС-22п+', 8),
(34, 'Червяков', 'Данил', 'Александрович', 'ИС-22п+', 8),
(35, 'Шарипов', 'Сергей', 'Александрович', 'ИС-22п+', 2),
(36, 'Ярмонова', 'Елизавета', 'Сергеевна', 'ИС-22п+', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `variants`
--

CREATE TABLE `variants` (
  `id_variant` int NOT NULL,
  `student_id` int NOT NULL,
  `variant` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `variants`
--

INSERT INTO `variants` (`id_variant`, `student_id`, `variant`) VALUES
(100, 1, 2),
(101, 2, 1),
(102, 3, 9),
(103, 4, 9),
(104, 5, 10),
(105, 6, 5),
(106, 7, 1),
(107, 8, 3),
(108, 9, 2),
(109, 10, 6),
(110, 11, 10),
(111, 12, 4),
(112, 13, 10),
(113, 14, 7),
(114, 15, 5),
(115, 16, 6),
(116, 17, 3),
(117, 18, 9),
(118, 19, 8),
(119, 20, 7),
(120, 21, 4),
(121, 22, 5),
(122, 23, 3),
(123, 24, 6),
(124, 25, 8),
(125, 26, 3),
(126, 27, 1),
(127, 28, 4),
(128, 29, 5),
(129, 30, 6),
(130, 31, 4),
(131, 32, 8),
(132, 33, 2),
(133, 34, 2),
(134, 35, 7),
(135, 36, 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id_student`);

--
-- Индексы таблицы `variants`
--
ALTER TABLE `variants`
  ADD PRIMARY KEY (`id_variant`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `students`
--
ALTER TABLE `students`
  MODIFY `id_student` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT для таблицы `variants`
--
ALTER TABLE `variants`
  MODIFY `id_variant` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=136;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
